Repository: 84000/data-translation-memory
Catalog: toh672-v3.tmx
Source language: bo
Languages: en

source: དཔལ་ལྷ་མོ་ནག་མོའི་མཚན་བརྒྱ་རྩ་བརྒྱད་པ།
en: Śrīdevī Kālī’s One Hundred and Eight Names

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུ་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཞུགས་ཏེ། རྒྱུ་དང་འབྲས་བུའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་བདེན་པའི་མཚན་རྣམས་སྟོན་པར་མཛད་དོ། །
en: The Blessed One was dwelling on Vulture Peak Mountain, where he was delivering a teaching on correct names to all causal and resultant bodhisattvas.

source: དེའི་ཚེ་དཔལ་ལྷ་མོ་ནག་མོ་ཆེན་མོ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་སྟེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: At that time, Śrīdevī Mahākālī approached the Blessed One, circled him three times, and sat to one side in the presence of the Blessed One.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་བརྩོན་འགྲུས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སྲིན་མོའི་ཆ་ལུགས་ཀྱིས་འཇིག་རྟེན་པའི་དོན་མཛད་པའི་མཚན་གྱི་རྣམ་གྲངས་ཇི་ལྟ་བུ་ལགས་ཞེས་གསོལ་པ་དང་།
en: The bodhisattva Virility of a Lion asked the Blessed One, “Blessed One, what are the different names of this bodhisattva who acts for the benefit of the world while adorned as a rākṣasī?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་བརྩོན་འགྲུས་ལ་དགོངས་ནས་དཔལ་ལྷ་མོ་ནག་མོ་ལ་གཟིགས་ཏེ་འདི་སྐད་ཅེས་གསུངས་སོ། །ཐོས་བསམ་སྒོམ་ལ་ཆེར་གནས་པའི། །རྒྱུ་འབྲས་རྐྱེན་གྱི་བདག་ཉིད་ཅན། །
en: The Blessed One considered the bodhisattva Virility of a Lion, looked at Śrīdevī Kālī, and said: “You are identified as the cause, effect, and conditions That are paramount for listening, contemplating, and meditating.

source: འགྲོ་ལ་ཕན་མཛད་མཁས་པའི་མཆོག །
en: Supreme among the wise, you benefit beings.

source: དཔལ་ལྡན་ལྷ་མོ་ནག་མོ་འཕགས། །
en: You are the exalted Śrīdevī Kālī.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྲུལ་པ་སྟེ། །ས་ལྟར་བརྟན་པའི་གཞིར་གྱུར་པ། །ཡོན་ཏན་སྡུད་བྱེད་ཆུ་དང་འདྲ། །བྱང་ཆུབ་སྨིན་བྱེད་མེ་ལྟ་བུ། །
en: “You are a bodhisattva emanation, A foundation as stable as the earth, You gather good qualities like water, And cause awakening to ripen, like fire.

source: དགེ་བའི་འདུ་བྱེད་རླུང་ལྟར་གཡོ། །ཤེས་རབ་རྣམ་དག་ནམ་མཁའ་སྟེ། །
en: “You gather virtue like the blowing wind And your insight is pure, like space.

source: ཁྱོད་ནི་འབྱུང་བ་ཆེན་པོ་འདྲ། །འབྱུང་པོ་ཕལ་ཆེན་རྣམས་ཀྱིས་བསྟོད། །
en: Thus are you like the great elements, Praised by great hosts of beings.

source: བསོད་ནམས་ཡེ་ཤེས་རབ་བསགས་པའི། །ལས་དང་རྣམ་སྨིན་དག་ལ་མཁས། །
en: “You know the actions and ripenings For accumulating merit and wisdom.

source: ང་རྒྱལ་གཟུགས་ཀྱིས་འདུལ་བ་གོམས། །ཤེས་རབ་སྙིང་རྗེའི་ལམ་དུ་འགྲོ། །
en: You know how to tame with your prideful form And travel the path of insight and compassion.

source: ཁྱོད་ནི་བུམ་པ་བཟང་ལྟ་བུ། །དཔེར་ན་ཡིད་བཞིན་ནོར་བུའི་ཆུ། །
en: “You are like a beautiful vessel With water like a wish-fulfilling jewel.

source: ཀུན་ལ་ཕན་པའི་དཔག་བསམ་ཤིང་། །ཉི་མ་འདྲ་བར་ཁྱོད་ལ་གསལ། །
en: You are a wish-fulfilling tree that benefits all And have a radiance like the sun.

source: ཟླ་ལྟར་གསལ་བའི་ཐུགས་མངའ་ཞིང་། །མིང་ནི་རི་བོང་རྭ་དང་འདྲ། །རང་གི་རྒྱུད་ནི་འཁོར་ལོ་འདྲ། །ཨུ་དུམ་བཱར་ལྟར་ཁྱོད་དཀོན་ཡང་། །
en: “Your mind shines like the moon, Your name is like the horns of a rabbit, Your mental continuum is like a circle, And you are rare like an udumbara flower.

source: བདུད་རྩི་ལྟ་བུར་ཡོངས་ཚིམ་མཛད། །འགྲོ་བ་ཀུན་གྱི་བདག་མོ་ལགས། །རང་བཞིན་མེད་པའི་ཆོས་ཀྱང་སྟོན། །ཆུ་དང་ནམ་མཁའི་ཚུབ་མ་ལྟར། །
en: “You completely satisfy like amṛta, Are the ruler of all beings, Teach that there is no inherent nature, And are like a storm of water and sky.

source: གདུལ་བྱའི་སྲིད་གསུམ་ཅིས་ཀྱང་འདུལ། །དུས་གསུམ་རྒྱལ་བའི་བསྟན་པ་སྐྱོང་། །
en: “You use any means to tame disciples in the three existences And protect the teachings of the victors of the three times.

source: དམ་པ་རྣམས་དང་ཡང་དག་གཅིག །དམ་པ་རྣམས་ཀྱི་ལམ་དུ་འགྲོ། །
en: You are truly one with holy beings And travel the path of the holy ones.

source: ལྷ་མོ་མ་མོ་གནོད་སྦྱིན་མོ། །སྲིན་མོ་ཀླུ་མོ་ཤ་ཟ་མོ། །གདུག་མོ་འབྱུང་མོ་གྲུལ་བུམ་མོ། །དྲག་མོ་རྔམ་ཚུལ་གློག་འགྱུ་མ། །
en: “You are a goddess, mātṛkā, yakṣiṇī, Rākṣasī, nāgī, piśācī, Vyāḍā, bhūtā, kumbhāṇḍā, Rudrā, and ravenous vidyutā.

source: རླུང་མོ་ནག་མོ་འཇིགས་བྱེད་མ། །མཁའ་འགྲོ་གཏུམ་མོ་ཞིང་སྒྲོལ་མ། །
en: “You are a wind goddess, Kālī, Bhairavī, A ḍākinī, Caṇḍālī, and Tārā.

source: ཞི་རྒྱས་དབང་དང་དྲག་པོས་འདུལ། །དཀར་སེར་ལྗང་ནག་དམར་ཡང་སྟོན། །
en: You tame through rites of pacifying, enriching, enthralling, and assault, And display the colors white, yellow, green, black, and red.

source: རྣམ་པ་བརྒྱད་ཀྱི་དབྱིབས་ཀྱང་འབྱུང་། །འགྲོ་བ་དྲུག་པོའི་ཚུལ་ཡང་སྟོན། །ཕུང་པོ་ལྔ་ཡང་བརྗོད་པར་ནུས། །དབང་པོ་ཚིམ་བྱེད་ཡུལ་ལྔའང་སྟོན། །
en: “You appear in eight different forms, Teach in a way suitable for beings in the six realms, Are able to explain the five aggregates, Satisfy the senses, and teach the five sense objects.

source: རྟེན་ཅིང་འབྲེལ་བའི་སྤྱོད་པ་མཁས། །ཡུལ་ཅན་རྣམས་ནི་གསོད་ལ་མཁས། །དེ་བཞིན་ངག་རྣམས་གསོད་པ་དང་། །ལུས་ཅན་རྣམས་ནི་གསོད་ལ་བརྩོན། །སེམས་ནི་གསོད་པ་མེད་ལ་མཁས། །
en: “You understand the workings of dependent origination, Are skilled in severing the sense organs, Are similarly skilled in killing all enemies, And strive to kill all embodied beings While knowing well that the mind is not killed.

source: འཁོར་བ་ལས་ནི་རིང་དུ་སོང་། །དེ་བཞིན་གཤེགས་པས་ལུང་བསྟན་ཏེ། །བྱང་ཆུབ་སེམས་དཔའི་མཚན་རྣམས་དང་། །
en: “You are far removed from saṃsāra, With the attributes of a bodhisattva, And have been prophesied by the thus-gone ones.

source: འཇིག་རྟེན་སྐྱོང་མཛད་དཔལ་ལྡན་མ། །དམ་ཆོས་འཛིན་པ་རྣམས་ལ་བྱམས། །
en: Glorious Lady who protects the world, You are a friend to those who preserve the holy Dharma.

source: ཨོཾ་ཨཱཿཧཱུྃ་ཤྲཱི་དེ་བི་ཀཱ་ལི་ས་མ་ཡ་ཛཿཌཱ་གི་ནཱེ་ཌཱ་ཡ་ས་མ་ཡ་སྭཱ་ཧཱ། མིང་བརྒྱ་རྩ་བརྒྱད་གང་འཛིན་པ། །ཡོན་ཏན་བརྒྱ་རྩ་བརྒྱད་ཀྱང་འཐོབ། །
en: oṁ āḥ hūṁ śrīdevi kāli samayaja­ḍākinīḍāya samaya svāhā “Those who grasp these one hundred and eight names Will also attain one hundred and eight qualities.

source: དམྱལ་བའི་སྡུག་བསྔལ་མྱོང་མི་འགྱུར། །ཡི་དགས་གནས་སུ་མི་སྐྱེ་ཞིང་། །བྱོལ་སོང་སྐྱེ་བས་ཐོགས་མི་འགྱུར། །
en: They will not experience the suffering of hell, Will not take birth in the preta realm, And will never be burdened with an animal birth.

source: ལུས་འཕགས་གནས་སུ་སྐྱེས་པ་ན། །ཐོག་ལ་སོགས་པ་མི་འབབ་ཅིང་། །སྒྲ་མི་སྙན་དུ་རླུང་གིས་མིན། །དེ་བཞིན་བ་ལང་སྤྱོད་དུ་ཡང་། །ཆུ་དང་རླབས་ཀྱིས་ཁྱེར་མི་ནུས། །
en: “If they are born in the land of Videha, They will not be struck by lightning and the like, They will not be affected by wind in Uttarakuru, And the rivers and floods in Godānīya Will not be able to sweep them away.

source: འཛམ་བུའི་གླིང་དུ་གང་སྐྱེས་པ། །སྣ་ཚོགས་གནོད་པས་ཉེན་མི་འགྱུར། །
en: “Those who are born in Jambudvīpa, Will not be threatened by its many dangers.

source: འདོད་པའི་ལྷ་རྣམས་གནས་སུ་ཡང་། །སྐྱེས་ནས་ཆོས་ལ་དགའ་བར་འགྱུར། །
en: When born among the gods of the desire realm, They will delight in the Dharma.

source: བསམ་གཏན་བཞི་ཡི་སྐྱེ་གནས་སུ། །ཚད་མེད་བཞི་ནི་འཕེལ་བར་འགྱུར། །
en: “For those who are born in the four dhyāna states, The four immeasurables will increase.

source: གཟུགས་མེད་གནས་ནི་བཞི་པོར་ཡང་། །དོན་མེད་ན་ནི་མི་སྐྱེ་སྟེ། །འདུ་ཤེས་མེད་པར་ནམས་ཀྱང་མིན། །
en: In the four formless realms There are no referents and there is no birth, But still they will not lack perception.

source: འཕགས་པ་བཞུགས་པའི་གནས་རྣམས་སུ། །ཁམས་གསུམ་ཚུལ་གྱིས་བདག་དོན་སྤྱོད། །རྟག་ཏུ་ཡུལ་ལ་ཆགས་མི་འགྱུར། །
en: “In the abodes of the noble ones, They will serve their own purpose in the manner of the three realms, All without attachment to objects as permanent.

source: སེམས་ལ་འཛིན་པར་མི་བྱེད་དེ། །ཉོན་མོངས་རྩ་བ་དྲུག་པོ་དང་། །དེ་བཞིན་ཉེ་བ་ཉི་ཤུ་དང་། །མཚམས་མེད་ལྔ་ཡང་བྱང་བར་འགྱུར། །
en: They will not grasp at thought And will purify the six root afflictions, The twenty derivative afflictions, And even the five inexpiable acts.

source: བསྐལ་པ་གྲངས་མེད་མང་པོར་ཡང་། །མི་ཁོམ་བརྒྱད་དུ་སྐྱེ་མི་འགྱུར། །
en: “They will not be born in the eight unfavorable conditions For many incalculable eons.

source: མུ་སྟེགས་རྩོད་པ་བཟློག་པ་དང་། །མཐུ་སྟོབས་ཕུན་སུམ་ཚོགས་ལྡན་ཞིང་། །
en: They will refute the critiques of non-Buddhists And possess exceptional power.

source: ཚེ་རིང་ནད་མེད་དཔལ་དང་ལྡན། །སྡུག་མེད་བསྐལ་པ་མང་པོར་ཡང་། །
en: “They will have a long life, good health, and good fortune, And not experience hardship for many eons.

source: ནམས་ཀྱང་འཁོར་བར་མི་ལྟུང་ཞིང་། །མྱ་ངན་འདས་པ་ཐོབ་བྱའི་ཕྱིར། །ཉན་ཐོས་ས་རྣམས་ནོན་པ་དང་། །རྟེན་འབྲེལ་བཅུ་གཉིས་ཤེས་པར་བྱ། །
en: They will never fall in saṃsāra, But in order to attain nirvāṇa Will traverse the grounds of the śrāvakas And understand the twelve links of dependent origination.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་རྣམས་ནི། །རབ་དགའ་དྲི་མེད་འོད་བྱེད་འཕྲོ། །སྦྱང་དཀའ་མངོན་འགྱུར་རིང་དུ་སོང་། །མི་གཡོ་ལེགས་པ་ཆོས་ཀྱི་སྤྲིན། །
en: “They will traverse the bodhisattva grounds: Joyful, Stainless, Illuminating, Radiant, Difficult to Conquer, Manifest, Far Reaching, Unwavering, Eminence, and Cloud of Dharma.

source: སངས་རྒྱས་ས་ཆེན་བླ་ན་མེད། །བཅུ་གཉིས་པོ་ཡང་ཐོབ་འགྱུར་ཏེ། །ཀུན་དུ་འོད་དང་བདུད་རྩི་འོད། །ནམ་མཁའི་འོད་དང་རྡོ་རྗེའི་འོད། །རིན་ཆེན་འོད་དང་པདྨའི་འོད། །ལས་ཀྱི་འོད་དང་དཔེ་མེད་ས། །དཔལ་ལྡན་ས་དང་ཤེས་རབ་འོད། །
en: “They will complete the twelve unsurpassed great grounds of a buddha: Universal Light, Light of Immortality, Light of Space, Vajra Light, Jeweled Light, Lotus Light, Light of Karma, the Incomparable Ground, The Glorious Ground, Light of Insight, Omniscience, and Self-Reflexive Awareness.

source: ཐམས་ཅད་མཁྱེན་དང་རང་རིག་སྟེ། །བཅུ་གཉིས་སངས་རྒྱས་ས་རྣམས་ཀྱང་། །འདི་ཚེ་བྱུང་ན་མྱུར་དུ་ཐོབ། །
en: The twelve buddha grounds Will be quickly completed as they occur.

source: ས་རྣམས་མ་ཐོབ་པར་དུ་ཡང་། །འགྲོ་བ་རྣམས་ལ་ཕན་པ་དང་། །ཤེས་རབ་སྙིང་རྗེ་ལྡན་གྱུར་ཅིང་། །ཆོས་ལ་དགའ་བ་རྣམས་ཀྱིས་བསྲུང་། །
en: “Even when these levels are not yet attained, They will benefit beings, Come to possess insight and compassion, And be protected by those who delight in the Dharma.

source: དངོས་གྲུབ་ཐོབ་སྟེ་དེ་བཞིན་གཤེགས། །རིན་ཆེན་ལས་བྱུང་ཐོབ་པར་འགྱུར། །
en: They will attain siddhi And become thus-gone ones born from jewels.

source: དཔལ་ལྡན་བྱང་ཆུབ་སེམས་དཔའ་དང་། །དཔལ་ལྡན་ལྷ་མོ་ནག་མོ་ཡི། །མིང་བརྒྱ་རྩ་བརྒྱད་གང་འཛིན་པ། །ཡོན་ཏན་བརྒྱ་རྩ་བརྒྱད་ཐོབ་སྟེ། །
en: “Those who bear in mind The one hundred and eight names Of the glorious bodhisattva, Śrīdevī Kālī, Will attain one hundred and eight qualities.

source: སྐུ་གསུང་ཐུགས་ནི་གྲུབ་ནས་ཀྱང་། །ཁམས་གསུམ་ཆོས་ཀྱི་རྒྱལ་པོར་འགྱུར། །ཞེས་གསུངས་པ་དང་།
en: They will perfect their body, speech, and mind, And become dharma kings of the three realms.”

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་དང་། དཔལ་ལྷ་མོ་ནག་མོ་ཆེན་མོ་རྣམས་ངོ་མཚར་དུ་གྱུར་ཏེ། །བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་རྗེས་སུ་ཡི་རང་ཞིང་མངོན་པར་བསྟོད་དོ།། །།
en: When this was said, Śrīdevī Mahākālī and those in the assembly of bodhisattvas were amazed, and rejoiced and praised the words of the Blessed One.

source: དཔལ་ལྷ་མོ་ནག་མོ་ཆེན་མོའི་མཚན་བརྒྱ་རྩ་བརྒྱད་པ་ཡོན་ཏན་དང་བཅས་པ་རྫོགས་སོ།།
en: This concludes “Śrīdevī Kālī’s One Hundred and Eight Names and Her Qualities.”
